================================================================================
Interface annotation
================================================================================

---@interface IShape
---@field width number
---@field height number

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (class_annotation
      name: (identifier)))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier))))))))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier)))))))))

================================================================================
Enum with fields
================================================================================

---@enum Color
---@field RED number
---@field GREEN number
---@field BLUE number

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (enum_annotation
      name: (identifier)))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier))))))))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier))))))))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier)))))))))

================================================================================
Async function type
================================================================================

---@type async fun(url: string): Promise

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (type_annotation
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (function_type
                params: (param_list
                  (param_def
                    name: (identifier)
                    type: (type
                      (primary_type
                        (basic_type
                          (identifier))))))
                return: (type_list
                  (type
                    (primary_type
                      (basic_type
                        (identifier)))))))))))))

================================================================================
Namespace annotation
================================================================================

---@namespace math.vector
---@class Vector2
---@field x number
---@field y number

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (namespace_annotation
      name: (identifier)))
  (annotation
    (comment_prefix)
    (class_annotation
      name: (identifier)))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier))))))))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier)))))))))

================================================================================
Using annotation
================================================================================

---@using "external.module"

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (using_annotation
      path: (string))))

================================================================================
Readonly annotation
================================================================================

---@readonly
---@field const number

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (readonly_annotation))
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier)))))))))

================================================================================
As annotation
================================================================================

---@as Vector2

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (as_annotation
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier)))))))))

================================================================================
Attribute definition
================================================================================

---@attribute deprecated(message: string)

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (attribute_annotation
      name: (identifier)
      params: (attribute_params
        (attribute_param
          name: (identifier)
          type: (type
            (primary_type
              (basic_type
                (identifier)))))))))

================================================================================
Attribute use on field
================================================================================

---@field oldField string
---@[deprecated]

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (field_annotation
      name: (field_name)
      type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier))))))))
  (annotation
    (comment_prefix)
    (attribute_use
      attributes: (attribute_use_list
        (attribute_use_item
          name: (identifier))))))

================================================================================
Keyof type operator
================================================================================

---@type keyof MyClass

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (type_annotation
      type: (type_annotation_value
        (type_list
          (type
            (unary_type
              argument: (primary_type
                (basic_type
                  (identifier))))))))))

================================================================================
Operator with parameters
================================================================================

---@operator(add)(other: Vector): Vector

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (operator_annotation
      op: (operator)
      params: (param_list
        (param_def
          name: (identifier)
          type: (type
            (primary_type
              (basic_type
                (identifier))))))
      return_type: (type_annotation_value
        (type_list
          (type
            (primary_type
              (basic_type
                (identifier)))))))))

================================================================================
Language annotation
================================================================================

---@language lua

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (language_annotation
      language: (identifier))))

================================================================================
Export annotation
================================================================================

---@export
---@class MyClass

--------------------------------------------------------------------------------

(source
  (annotation
    (comment_prefix)
    (export_annotation))
  (annotation
    (comment_prefix)
    (class_annotation
      name: (identifier))))
